{
    "status": "success",
    "totalResults": 14863,
    "results": [
        {
            "article_id": "de8211dd03e6175e027dcb6ff6fe0baa",
            "title": "Apple iOS 17.3 Beta Version Introduces New Stolen Device Protection Feature for Users To Protect Their iPhones, Know How It Works",
            "link": "https://www.latestly.com/socially/technology/apple-ios-17-3-beta-version-introduces-new-stolen-device-protection-feature-for-users-to-protect-their-iphones-know-how-it-works-5626820.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Apple iOS 17.3 beta update introduced new iPhone security feature called 'Stolen Device Protection' to help the users in protecting their iPhones from being stolen.",
            "content": "Apple has launched a new security feature for the iPhone to help users protect their devices from being stolen. The latest stolen device protection feature launched in iOS 17.3 beta provides iPhone users an additional layer of safety and security. If someone may have acquired the iPhone's password, this new feature will work to protect the device. According to the report from CBS News, the new Stolen Device Protection feature requires biometric information like fingerprint or face scan to access the device's functions. The protection mode automatically gets activated when the iPhone is in an \"unknown\" location. Users will be prompted immediately for the first time and an hour later for second time. The report further said that the threats to the iPhones continue to evolve, so Apple is testing new settings. Apple has introduced a new stolen device protection feature for the iPhone in the iOS 17.3 beta The new feature adds an additional layer of security in case that someone has stolen your phone and also obtained your passcode — Apple Hub (@theapplehub)",
            "pubDate": "2023-12-13 08:05:07",
            "image_url": "https://st1.latestly.com/wp-content/uploads/2023/08/191-1-380x214.jpg",
            "source_id": "latestly",
            "source_priority": 5523,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "4751e061d65f5b6f57eacdbbfd01827d",
            "title": "Why Are Their Different Skincare Requirements Pre and Post Workout? Experts Explain",
            "link": "https://news.abplive.com/lifestyle/why-are-their-different-skincare-requirements-pre-and-post-workout-1635119",
            "keywords": [
                "Lifestyle"
            ],
            "creator": [
                "Utsa Ganguly"
            ],
            "video_url": null,
            "description": "<p><span style=\"font-weight: 400;\">Maintaining healthy skin is a concern for many, and for good reason. Our skin is not only the largest organ in our body, but it also plays a vital role in protecting us from external environmental factors. Physical activity is an integral part of a healthy lifestyle, but have you ever wondered why your skin requires different care before and after workouts? In this article, we'll explore the reasons behind the distinct skincare requirements for pre and post-workout routines from a dermatologist's point of view.</span></p> <h3><strong>Pre-Workout Skincare:</strong></h3> <p><span style=\"font-weight: 400;\">Before embarking on any physical activity, it's crucial to prepare your skin to minimize potential damage and discomfort. Here's why pre-workout skincare matters mentioned by </span>Dr. Kisalay Saurav who is a Dermatologist &amp; Cosmetologist and founder of Dr. Saurav&rsquo;s Skin Clinic, Bengaluru:</p> <ul> <li><span style=\"font-weight: 400;\"><strong>Cleansing:</strong> The starting point of any skincare routine is cleansing. Before a workout, a gentle cleanse is essential to remove dirt, excess oil, and makeup. These substances can clog pores and contribute to skin issues like acne and irritation during exercise.</span></li> <li><span style=\"font-weight: 400;\"><strong>Hydration:</strong> Pre-workout hydration is crucial for overall health, and it extends to your skin as well. Well-hydrated skin is more resilient and less prone to drying out during exercise. Drinking water helps maintain skin's elasticity and flushes out toxins.</span></li> <li><span style=\"font-weight: 400;\"><strong>Sun Protection:</strong> If your workout involves outdoor activities, sun protection is paramount. Exposure to UV rays can lead to premature aging, sunburn, and an increased risk of skin cancer. Apply a broad-spectrum sunscreen with an SPF of at least 30, even on cloudy days.</span></li> <li><span style=\"font-weight: 400;\"><strong>Minimize Makeup:</strong> Heavy makeup can clog pores and exacerbate sweat-related skin issues. Opt for lightweight, non-comedogenic makeup products or skip makeup altogether before a workout.</span></li> </ul> <h3><strong>Post-Workout Skincare:&nbsp;</strong></h3> <p><span style=\"font-weight: 400;\">After a strenuous workout, your skin requires a different kind of care to recover and maintain its health. In his regard, </span>Dr. Blossom Kochhar suggested the following:</p> <ul> <li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Cleanse your face after a workout. It helps get rid of the sweat, oil, and dirt on your face.&nbsp;</span></li> <li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your hair needs a breather post your workout. So it&rsquo;s important to wash it with a mild shampoo. Use a towel to dry them instead of blow drying.&nbsp;</span></li> <li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">It is always recommended to change your clothes after your workout. Your skin releases toxins and sweat. These can clog your skin pores, which in turn leads to rashes and acne.</span></li> <li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">If the weather permits, try considering taking a quick shower post your workout. It helps your muscles relax and aids in better sleep.&nbsp;</span></li> <li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Once you are done with your workout, I would recommend using a face serum and moisturizer on your skin. This duo helps you protect and hydrate your skin. While also rendering a more youthful glow to your skin. Post this routine, you can wear your regular makeup.&nbsp;</span></li> </ul> <h3 style=\"font-weight: 400;\"><strong>Haircare Tips Pre And Post Workout:</strong></h3> <p style=\"font-weight: 400;\">Priti Rajput, who is the V.P - Marketing at WOW Skin Science mentioned, \"Skincare and haircare are essential elements of your pre-workout routine. Akin to the skin &ndash; the scalp also needs to be clean. Avoid oiling your hair prior to a workout and in case of an oily scalp &ndash; clean it thoroughly after the completion of the workout. In addition, the styling of the hair is as important as it is ideal to limit movement of the hair during a workout &ndash; a bun for example &ndash; as it avoids excessive tugging of the root which may lead to higher pressure on them, leading to excessive hair fall.\"</p>",
            "content": "Maintaining healthy skin is a concern for many, and for good reason. Our skin is not only the largest organ in our body, but it also plays a vital role in protecting us from external environmental factors. Physical activity is an integral part of a healthy lifestyle, but have you ever wondered why your skin requires different care before and after workouts? In this article, we'll explore the reasons behind the distinct skincare requirements for pre and post-workout routines from a dermatologist's point of view. Pre-Workout Skincare: Before embarking on any physical activity, it's crucial to prepare your skin to minimize potential damage and discomfort. Here's why pre-workout skincare matters mentioned by Dr. Kisalay Saurav who is a Dermatologist & Cosmetologist and founder of Dr. Saurav’s Skin Clinic, Bengaluru: Cleansing: The starting point of any skincare routine is cleansing. Before a workout, a gentle cleanse is essential to remove dirt, excess oil, and makeup. These substances can clog pores and contribute to skin issues like acne and irritation during exercise. Hydration: Pre-workout hydration is crucial for overall health, and it extends to your skin as well. Well-hydrated skin is more resilient and less prone to drying out during exercise. Drinking water helps maintain skin's elasticity and flushes out toxins. Sun Protection: If your workout involves outdoor activities, sun protection is paramount. Exposure to UV rays can lead to premature aging, sunburn, and an increased risk of skin cancer. Apply a broad-spectrum sunscreen with an SPF of at least 30, even on cloudy days. Minimize Makeup: Heavy makeup can clog pores and exacerbate sweat-related skin issues. Opt for lightweight, non-comedogenic makeup products or skip makeup altogether before a workout. Post-Workout Skincare: After a strenuous workout, your skin requires a different kind of care to recover and maintain its health. In his regard, Dr. Blossom Kochhar suggested the following: Cleanse your face after a workout. It helps get rid of the sweat, oil, and dirt on your face. Your hair needs a breather post your workout. So it’s important to wash it with a mild shampoo. Use a towel to dry them instead of blow drying. It is always recommended to change your clothes after your workout. Your skin releases toxins and sweat. These can clog your skin pores, which in turn leads to rashes and acne. If the weather permits, try considering taking a quick shower post your workout. It helps your muscles relax and aids in better sleep. Once you are done with your workout, I would recommend using a face serum and moisturizer on your skin. This duo helps you protect and hydrate your skin. While also rendering a more youthful glow to your skin. Post this routine, you can wear your regular makeup. Haircare Tips Pre And Post Workout: Priti Rajput, who is the V.P - Marketing at WOW Skin Science mentioned, \"Skincare and haircare are essential elements of your pre-workout routine. Akin to the skin – the scalp also needs to be clean. Avoid oiling your hair prior to a workout and in case of an oily scalp – clean it thoroughly after the completion of the workout. In addition, the styling of the hair is as important as it is ideal to limit movement of the hair during a workout – a bun for example – as it avoids excessive tugging of the root which may lead to higher pressure on them, leading to excessive hair fall.\" googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });",
            "pubDate": "2023-12-13 08:04:22",
            "image_url": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/13/e3747f36947726af05418b8e4ff24a821702454633102557_original.png",
            "source_id": "abplive",
            "source_priority": 10959,
            "country": [
                "india"
            ],
            "category": [
                "entertainment"
            ],
            "language": "english"
        },
        {
            "article_id": "96c1afa49809620fc4006276d8d73cc4",
            "title": "Arbitration Clauses in Unstamped Agreements are Enforceable: Supreme Court [Read Order]",
            "link": "https://www.taxscan.in/arbitration-clauses-in-unstamped-agreements-are-enforceable-supreme-court-read-order/352678/",
            "keywords": [
                "Headlines",
                "Top Stories",
                "Agreements",
                "Justice D Y Chandrachud",
                "Justice J B Pardiwala",
                "Justice K M Joseph",
                "void ab initio"
            ],
            "creator": [
                "Anas"
            ],
            "video_url": null,
            "description": "A Seven Judge Bench of the Supreme Court of India observed that the arbitration clauses in unstamped agreements are enforceable. The bench comprising Chief Justice of India DY Chandrachud, Justice Sanjay Kishan Kaul, Justice Sanjiv Khanna, Justice B R Gavai, Justice Surya Kant, Justice JB Pardiwala, and Justice Manoj Misra passed the judgement in the […]",
            "content": "A Seven Judge Bench of the Supreme Court of India observed that the arbitration clauses in unstamped agreements are enforceable. The bench comprising Chief Justice of India DY Chandrachud, Justice Sanjay Kishan Kaul, Justice Sanjiv Khanna, Justice B R Gavai, Justice Surya Kant, Justice JB Pardiwala, and Justice Manoj Misra passed the judgement in the… © 2020 Taxscan © 2020 Taxscan",
            "pubDate": "2023-12-13 08:01:44",
            "image_url": "https://www.taxscan.in/wp-content/uploads/2023/12/Arbitration-Clauses-Unstamped-Agreements-Supreme-Court-unstamped-agreements-are-enforceable-agreements-taxscan-110x80.jpg",
            "source_id": "taxscan",
            "source_priority": 4352762,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "e9d046d74d0215f0e4590b49a40e2a53",
            "title": "Karnataka: Man Arrested for Hoax Bomb Threat at Raj Bhavan, 34-Year-Old Made Prank Call Out of 'Curiosity'",
            "link": "https://www.latestly.com/india/news/karnataka-man-arrested-for-hoax-bomb-threat-at-raj-bhavan-34-year-old-made-prank-call-out-of-curiosity-5626766.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "A 34 year-old man who allegedly made a hoax bomb call to the Raj Bhavan here has been arrested from Andhra Pradesh. He did so out of 'curiosity' and has no criminal record, a senior police official said on Wednesday.",
            "content": ": A 34 year-old man who allegedly made a hoax bomb call to the Raj Bhavan here and arrested from Andhra Pradesh, did so out of 'curiosity' and has no criminal record, a senior police official said on Wednesday. Bhasker was arrested from Chittoor in Andhra Pradesh, police said. A B.Com graduate, he is into agriculture and hails from Vadahalli village in Mulbagal taluk of Kolar district, they said. A phone call claiming that a bomb was planted inside the Raj Bhavan premises here and could go off anytime threw the city police into a tizzy on night of December 11. The police scrambled all over the Governor's official residence and finally concluded that it was a hoax call. The investigation revealed that the accused had come to Bengaluru on Monday night and while passing by Raj Bhavan, searched for the contact number of NIA's (National Investigation Agency) control room online. He made a call claiming about the presence of a bomb inside the premises of Raj Bhavan. The city police were immediately alerted about the matter and necessary action was taken. Later, an investigation revealed that the bomb threat was a hoax call, a senior police officer said. Initially, it was suspected by the police that the call was made from Bidar, about 600 km from the state capital. After the alleged call, the mobile phone was found to be switched off. However, using technical surveillance, the police later traced the caller to Chittoor in AP from where the accused was arrested on Tuesday night, he said. \"The accused made the call out of curiosity...just like that, without knowing the consequences of his action. We have checked his background and he does not have any previous criminal record. We registered a case against him and made the arrest on Tuesday evening,\" he added.",
            "pubDate": "2023-12-13 08:01:03",
            "image_url": "https://st1.latestly.com/wp-content/uploads/2023/10/Arrest-380x214.jpg",
            "source_id": "latestly",
            "source_priority": 5523,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "d45abdf265ee5ae522b025c3a15fa347",
            "title": "Parenting With Perinatal OCD: Strategies For Navigating Compulsions And Fears",
            "link": "https://www.thehealthsite.com/pregnancy/parenting-with-perinatal-ocd-strategies-for-navigating-compulsions-and-fears-1043610/",
            "keywords": [
                "Pregnancy",
                "Obsessive Compulsive Disorder",
                "OCD",
                "Perinatal OCD",
                "post-childbirth ocd"
            ],
            "creator": [
                "saumya pandey"
            ],
            "video_url": null,
            "description": "Shedding light on perinatal OCD is essential for dismantling stigma, encouraging early intervention, and fostering a supportive environment for affected individuals.",
            "content": "Shedding light on perinatal OCD is essential for dismantling stigma, encouraging early intervention, and fostering a supportive environment for affected individuals. Perinatal OCD, a subset of obsessive-compulsive disorder, presents unique challenges for new parents, particularly mothers. Characterized by intrusive and distressing thoughts coupled with compulsive behaviors, this condition often centers around fears and anxieties related to the newborn. The condition commonly gives rise to thoughts involving harm, illness, or death concerning the baby. Mothers may find themselves compelled to repeatedly check if their infants are breathing or take excessive precautions, struggling to be away from their babies. Studies indicate that perinatal OCD may develop or worsen in approximately 17% of pregnancies, with the highest risk post-childbirth. Identifying Risk Factors Individuals with a personal or family history of OCD, anxiety, or depression face a higher risk, though can manifest without prior indicators. Sadly, many avoid seeking care, fearing potential harm to the baby through medication. Reproductive psychiatrists emphasize that the medications used to treat these conditions during pregnancy are generally low risk, while untreated mental health conditions pose significant risks to both mother and baby. Breaking The Silence: Overcoming Stigma One significant challenge is the stigma surrounding perinatal OCD, as mothers may experience graphic or disturbing thoughts about harming their infants. The fear of judgment or potential intervention leads to secrecy, amplifying the shame associated with these symptoms. Distinguishing perinatal OCD from more , such as postpartum psychosis, is crucial for accurate diagnosis and appropriate intervention. Expanding The Narrative: It's Not Just About the Baby Perinatal OCD extends beyond thoughts solely related to the baby. Individuals share their experiences, highlighting obsessive thoughts encompassing existential fears, self-harm, and the meaning of life. This broader perspective underscores the diverse and complex nature of perinatal OCD manifestations. Hope And Healing: Treatment Approaches Effective treatment involves a combination of medication and evidence-based therapies. Selective serotonin reuptake inhibitors (SSRIs) are commonly prescribed and considered safe during pregnancy and breastfeeding. Cognitive-behavioral therapy, particularly exposure and response , equips individuals to confront and manage their fears actively. Personal Stories: Triumph Over Perinatal OCD Personal narratives exemplify the transformative power of treatment. Through medication and cognitive-behavioral therapy, gained control over the symptoms, emphasizing the importance of facing fears and gradually desensitizing oneself. Empowering Parenthood Despite OCD Perinatal OCD, though challenging, doesn't negate the possibility of empowered parenthood. Individuals like Erin demonstrate that, with the right tools and support, it's possible to navigate intrusive thoughts and compulsions. By proactively addressing safety concerns and incorporating therapeutic strategies, individuals with perinatal OCD can foster a sense of control and resilience. Conclusion: Shaping A Supportive Narrative Shedding light on perinatal OCD is essential for dismantling stigma, encouraging early intervention, and fostering a supportive environment for affected individuals. By amplifying awareness, understanding, and access to mental health care, society can contribute to a more compassionate and informed approach to perinatal mental health.",
            "pubDate": "2023-12-13 08:00:41",
            "image_url": "https://st1.thehealthsite.com/wp-content/uploads/2023/12/side-view-mother-with-cute-newborn-655x353.jpg",
            "source_id": "thehealthsite",
            "source_priority": 13386,
            "country": [
                "india"
            ],
            "category": [
                "health"
            ],
            "language": "english"
        },
        {
            "article_id": "6f51eb8c9a083ecef159cb501deacb0b",
            "title": "After Day 1 of Trial, Giuliani Doubled Down on Remarks",
            "link": "https://news.knowledia.com/all/all/articles/after-day-1-of-trial-giuliani-doubled-down-on-remarks-6674b2c150f192ab32fb3cc46144a7b3e3ddcd5f?source=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Judge says he may have defamed Georgia election workers again - www.newser.com",
            "content": "The first day of Rudy Giuliani's defamation damages trial may have led to yet more legal trouble for the former New York City mayor. In remarks outside the federal courthouse in Washington, DC on Monday, Giuliani doubled down on his remarks about two Georgia election workers and the judge overseeing the case said he may have defamed them again, UPI reports. Giuliani told reporters that he doesn't regret his past comments about Ruby Freeman and daughter Shaye Moss. \"Everything I said about them is true,\" he said. \"They were engaging in changing votes.\" Giuliani—who has already been found liable for defamation—said he planned to prove that his allegations were… Rob Quinn",
            "pubDate": "2023-12-13 08:00:23",
            "image_url": "https://img2-azrcdn.newser.com/image/1506967-17-20231212170431-judge-giuliani-may-defamed-plaintiffs.jpeg",
            "source_id": "knowledia",
            "source_priority": 167779,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "130ae03a5a4db9890f01cfb0991ba96b",
            "title": "Planned Parenthood received nearly $1.8 billion in federal funds, pandemic loans in three years",
            "link": "https://news.knowledia.com/all/all/articles/planned-parenthood-received-nearly-18-billion-in-federal-funds-ccf4c95508e1de6e0f80ea5107f83fe54f311e83?source=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Planned Parenthood affiliates raked in nearly $2 billion in federal funds from 2019-21, including millions in forgiven pandemic loans, even though Republicans contend that the nation's largest abortion provider should have been ineligible for the small-business program. - www.washingtontimes.com",
            "content": "The report released Tuesday by the Government Accountability Office found that Planned Parenthood collected $1.78 billion, or an average of $592 million per year, in federal funds during the three-year period that covered the COVID-19 pandemic. Most of the funding ($1.53 billion) came from Medicare, Medicaid and Children's Health Insurance Program reimbursements, while grants and cooperative agreements made up $148 million, according to the report requested by Sen. Marsha Blackburn, Tennessee Republican, and Rep. Chris Smith, New Jersey Republican. Ms. Blackburn called it \"appalling that big abortion providers are continuing to receive billions of dollars in federal taxpayer funding.\" What further galled Republicans is that Planned Parenthood affiliates collected $90.4 million from the 2020 CARES Act's Paycheck Protection Program, despite its language saying that the forgivable loans were only for businesses and nonprofits with 500 or fewer employees. \"While small businesses struggled to make ends meet during the pandemic, Planned Parenthood illegally siphoned over $90 million from the Paycheck Protection Program, specifically designed to help our mom-and-pop shops keep their doors open,\" Ms. Blackburn said in a statement. We now know that nearly $2 BILLION in American taxpayer dollars has been funneled to big abortion from FY19-21. This is unconscionable. pic.twitter.com/GfeDHVfKwR — Sen. Marsha Blackburn… Valerie Richardson",
            "pubDate": "2023-12-13 08:00:11",
            "image_url": "https://media.washtimes.com/media/image/2023/11/08/Abortion_Missouri_80012--99452.jpg",
            "source_id": "knowledia",
            "source_priority": 167779,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "bb34ea26a191f653659db0eb564add36",
            "title": "Biden to meet with families of Americans taken hostage by Hamas on Wednesday at the White House",
            "link": "https://news.knowledia.com/all/all/articles/biden-to-meet-with-families-of-americans-taken-hostage-by-hamas-on-9fe34ed9cdd6938f8bb9a7d989661d85bf29f82f?source=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "President Joe Biden on Wednesday will hold his first in-person meeting with the families of Americans taken hostage by Hamas during its brutal attack on Israel on Oct. 7, two White House officials said. - www.washingtontimes.com",
            "content": "WASHINGTON — It was not immediately clear how many families would be attending the White House meeting in person, or via videoconference. Biden has previously met with some family members virtually and spoken to others on the phone, officials said. The officials spoke on the condition of anonymity to discuss Biden's schedule. \"We're… Zeke Miller , Colleen Long",
            "pubDate": "2023-12-13 08:00:11",
            "image_url": "https://media.washtimes.com/media/image/2023/12/12/Biden_85653.jpg",
            "source_id": "knowledia",
            "source_priority": 167779,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "2e18a54a243670b1a2acf82b277c0844",
            "title": "GOP senators demand Biden rescind rule on pandemic spending 'slush fund'",
            "link": "https://news.knowledia.com/all/all/articles/gop-senators-demand-biden-rescind-rule-on-pandemic-spending-slush-fund-a65ade3528e185703bab937a73930a1617ea559e?source=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Six Republican senators are demanding the Biden administration rescind a new rule that gives states and municipalities more time to find ways to spend billions in unused federal COVID-19 relief despite the pandemic having ended. - www.washingtontimes.com",
            "content": "In a letter Tuesday to the Treasury Department, the GOP senators said Congress \"will have no choice\" but to try to reverse the decision under the Congressional Review Act if the administration doesn't stop the new policy. \"It is imperative that Treasury rescind this rule immediately,\" the senators wrote. \"With our national debt hitting unprecedented levels, the federal government must act as responsible stewards of the taxpayer's dollars. An extension of COVID-19 era programs is especially perplexing as this administration ended the federal public health emergency for the pandemic on May 11, 2023.\" The Republicans who signed the letter are: Sens. Eric Schmitt of Missouri, Ron Johnson of Wisconsin, Mike Lee of Utah, Mike Braun of Indiana, Rick Scott of Florida and Roger Marshall of Kansas. The rule issued by the Treasury Department before the Thanksgiving holiday relaxes how states and municipalities must legally obligate money from the $350 billion Coronavirus State and Local Fiscal Recovery Fund by the end of next year. The fund was created as part of the $1.9 trillion American Rescue Plan signed by President Biden in 2021. The… Dave Boyer",
            "pubDate": "2023-12-13 08:00:11",
            "image_url": "https://media.washtimes.com/media/image/2023/06/13/Check_Fraud_95964--7acab.jpg",
            "source_id": "knowledia",
            "source_priority": 167779,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "99020454851b41d1298274f7f2285179",
            "title": "Ron DeSantis' campaign interactions with super PACs raised internal legal concerns, AP sources say",
            "link": "https://news.knowledia.com/all/all/articles/ron-desantis-campaign-interactions-with-super-pacs-raised-internal-legal-2437a201a41920772a79f034de9cb97ffb886921?source=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Ron DeSantis has visited each of Iowa's 99 counties. He has the endorsement of the governor and boasts the largest get-out-the-vote operation in the state. And he has predicted victory in Iowa's Jan. 15 caucuses. - www.washingtontimes.com",
            "content": "CEDAR RAPIDS, Iowa — But as the Florida governor works to project strength in the Republican primary and cut into former President Donald Trump's huge lead, DeSantis' expansive political machine is facing a churn of leadership, stagnant polling numbers and new concerns about potential legal conflicts. Specifically, there has been concern in recent weeks among some within DeSantis' operation that interactions between his campaign and his network of outside groups are blurring the lines of what's legally permissible. Multiple people familiar with DeSantis' political network said that he and his wife had expressed concerns about the messaging of Never Back Down, the largest super PAC supporting the governor's campaign, in recent months as his Iowa polling numbers stagnated in late summer and autumn. The governor and his wife, Casey, who is widely considered his top political adviser, were especially frustrated after the group took down a television ad last month that criticized leading Republican rival Nikki Haley for allowing a Chinese manufacturer into South Carolina when she was governor. DeSantis' team shared those messaging concerns with members of Never Back Down's board, which includes Florida-based members with close ties to the governor, according to multiple people briefed on the discussions. Some of the board members then relayed the DeSantis team's wishes to super PAC staff, which was responsible for executing strategy, the people said. The people spoke on the condition of anonymity to share internal discussions. Federal laws prohibit coordination between presidential campaigns and outside groups. There is no known lawsuit or federal complaint alleging DeSantis' campaign broke the law. And in the super PAC era that began with the Supreme Court's 2010 Citizens United decision, murky relationships between campaigns and allied outside groups have become commonplace. Still, Adav Noti, legal director for the Campaign Legal Center, said that the… Steve Peoples , Thomas Beaumont",
            "pubDate": "2023-12-13 08:00:11",
            "image_url": "https://media.washtimes.com/media/image/2023/12/12/Election_2024_DeSantis_52625.jpg",
            "source_id": "knowledia",
            "source_priority": 167779,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        }
    ],
    "nextPage": "1702454411201307389"
}