{
    "status": "success",
    "totalResults": 15116,
    "results": [
        {
            "article_id": "49e05acb18ebb88851e3ca3a9cbe1d9d",
            "title": "iPhone 16 batteries should preferably be made in India, Apple tells suppliers",
            "link": "https://9to5mac.com/2023/12/06/iphone-16-batteries/",
            "keywords": [
                "News"
            ],
            "creator": [
                "Ben Lovejoy"
            ],
            "video_url": null,
            "description": "As part of the company’s continuing work to reduce its dependence on China, Apple has reportedly told suppliers that it has a preference for iPhone 16 batteries being made in India. One battery supplier which already manufactures in India has been asked to scale-up production there, and Chinese suppliers have been urged to establish battery factories in the country … more…",
            "content": "As part of the company’s continuing work to reduce its dependence on , has reportedly told suppliers that it has a preference for batteries being made in . One battery supplier which already manufactures in India has been asked to scale-up production there, and Chinese suppliers have been urged to establish battery factories in the country … Apple’s over-dependence on China The decision to was originally made by company co-founder , and the establishment of a tightly-integrated supply-chain in the country was widely considered one of greatest accomplishments back when he was COO. At the time, the strategy made a huge amount of sense, and was key to Apple’s success. Since then, however, a great deal has changed. As we’ve long argued, Apple’s dependence on China has turned from one of its greatest strengths to arguably its greatest weakness – for three reasons. Being overly dependent on one country is a strategic risk. For example, the COVID-19 pandemic originated there, and had a massive impact on manufacturing capacity. Anything from a natural disaster to political upheaval could disrupt operations within a single country, so it is always wise to have a diverse range of manufacturing centers around the world. Second, the relationship between the US and China has often been fraught. The trade war started by the previous US administration was a particularly low point, but continued tensions mean that there is always a risk of disruptions to trade between the two countries. Third, it is increasingly damaging to Apple’s reputation to be so closely associated with a country that has a worsening human rights record – especially when the iPhone maker has no choice but to comply with local laws, however much they may conflict with the company’s own values. Producing iPhone 16 batteries in India A report says that Apple wants as many iPhone 16 batteries as possible to be made in India, not China. The world’s most valuable company has informed component suppliers of its preference to source batteries for the forthcoming iPhone 16 from Indian factories, according to two people close to Apple. Battery manufacturers, such as Desay of China, have been encouraged to establish new factories in India, while Simplo Technology, a Taiwanese battery supplier for Apple, has been asked to scale up production in India for future orders, said three people familiar with the situation. Japanese battery supplier TDK is also prepping its own production in India. An Indian government minister this week said TDK, a Japanese supplier for Apple, was setting up a 180-acre facility in Manesar in the state of Haryana to build battery cells that would be used in Indian-made iPhones. In a post on X, Rajeev Chandrasekhar, minister of state for electronics and IT, congratulated Apple, TDK and local officials for enabling the government’s “goal of deepening [the] electronics manufacturing ecosystem in India”. That won’t be up-and-running in time for the iPhone 16, however – the company says it expects to begin local production in 2025.",
            "pubDate": "2023-12-06 15:00:19",
            "image_url": "https://9to5mac.com/wp-content/uploads/sites/6/2023/12/iPhone-16-batteries.jpeg?quality=82&strip=all&w=1600",
            "source_id": "9to5mac",
            "source_priority": 2672,
            "country": [
                "united states of america",
                "united kingdom",
                "singapore",
                "india",
                "australia"
            ],
            "category": [
                "technology"
            ],
            "language": "english"
        },
        {
            "article_id": "7184e66d999fa2da5c754972a38f5814",
            "title": "India Unveils Ambitious Strategy For Steel Sector Decarbonisation",
            "link": "https://www.businessworld.in/article/India-Unveils-Ambitious-Strategy-For-Steel-Sector-Decarbonisation-/06-12-2023-501285",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "The immediate focus, up to the fiscal year 2030, revolves around bolstering energy and resource efficiency while embracing renewable energy. The government is determined to make strides in minimising carbon emissions within the short term",
            "content": "In a significant move towards environmental sustainability, the Indian government has outlined a comprehensive strategy to decarbonise the steel sector. The ambitious plan, spanning short, medium, and long terms, aims to reduce carbon emissions, promote energy and resource efficiency, and integrate renewable energy into the steel industry. The immediate focus, up to the fiscal year 2030, revolves around bolstering energy and resource efficiency while embracing renewable energy. The government is determined to make strides in minimising carbon emissions within the short term. The Minister of State for Steel, Faggan Singh Kulaste, presented these initiatives in response to a question in Lok Sabha, highlighting the government's commitment to steering the steel industry towards a sustainable and low-carbon future. Looking ahead to the medium term, spanning from 2030 to 2047, the strategy emphasises two pivotal areas: Green Hydrogen-based steelmaking and Carbon Capture, Utilisation, and Storage. These innovations are expected to play a key role in shaping a more sustainable steel industry. The long-term vision, extending from 2047 to 2070, underscores the importance of disruptive alternative technological innovations. These groundbreaking technologies are anticipated to facilitate the transition to a net-zero carbon emission steel sector. In a comprehensive approach toward decarbonising the steel sector, the Indian government has established thirteen task forces, bringing together industry experts, academia, think tanks, and diverse stakeholders to deliberate and recommend strategies for reducing carbon emissions. The Steel Scrap Recycling Policy of 2019 plays a pivotal role in enhancing the availability of domestically generated scrap, effectively curbing coal consumption in the steelmaking process. Additionally, the National Green Hydrogen Mission, initiated by the Ministry of New and Renewable Energy, places the steel sector as a key stakeholder in its focus on green hydrogen production. The Motor Vehicles Scrapping Rules introduced in September 2021 aim to bolster the availability of scrap in the steel sector. The National Solar Mission, promoting the use of solar energy, contributes significantly to emissions reduction in the steel industry. Under the Perform, Achieve, and Trade (PAT) Scheme, part of the National Mission for Enhanced Energy Efficiency, the steel industry is incentivized to reduce energy consumption. Furthermore, the sector is adopting globally recognised Best Available Technologies in its modernisation and expansion projects, while Japan's New Energy and Industrial Technology Development Organisation (NEDO) Model Projects for Energy Efficiency Improvement have found successful implementation in Indian steel plants.",
            "pubDate": "2023-12-06 14:59:36",
            "image_url": "https://static.businessworld.in/article/article_extra_large_image/1662712595_Qtl5ot_stainless_steel_pipes_1000x1000.jpg",
            "source_id": "businessworld",
            "source_priority": 150658,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "581f2aa550930422d62cb0e7ff121810",
            "title": "Karnataka High Court censures State govt. for causing litigation over tender due to lack of clarity on yardsticks under different schemes",
            "link": "https://www.thehindu.com/news/cities/bangalore/karnataka-high-court-censures-state-govt-for-causing-litigation-over-tender-due-to-lack-of-clarity-on-yardsticks-under-different-schemes/article67611045.ece",
            "keywords": [
                "Bengaluru"
            ],
            "creator": null,
            "video_url": null,
            "description": "“Ensure that policies are not in conflict with each other and they should benefit the public at large”",
            "content": "Censuring the State government for causing a large number of litigations related to civil contracts across Karnataka, owing to a lack of clarity and confusion in policies and circulars issued in 2022, the High Court of Karnataka has advised the government to ensure that policies are not in conflict with each other and they should benefit the public at large. The court made these observations on noticing conflicts in the parameters for awarding general contracts for civil works and those contracts for civil works entrusted under the Amritha Nagarothana scheme. The litigations had the effect of stalling the works initiated for the public, the court observed. Justice M.I. Arun passed the order on a batch of petitions filed by various taluk-level contractors’ associations, led by the Hangal Taluk Civil Contractors’ Association. The petitioners had questioned the packaging of civil works by clubbing various works to make the value of each tender over ₹1 crore. They contended that such packaging is contrary to a circular issued by the government on May 11, 2022 to ensure that the tender value should be less than ₹1 crore to enable the participation of small contractors in the tender process. However, the court noted that the government had failed to inform the court, during an earlier round of litigation, that there were separate yardsticks for awarding of tenders under the Amritha scheme and for general civil works. The government earlier had not brought to the court’s notice about the existence of Government Order (GO) of January 14, 2022, which was specifically applicable for Amritha scheme contracts, where the tender value has to be over ₹1 crore by clubbing various works, Justice Arun pointed out. Holding that the circular of May, 2022, which was issued after a meeting of the Karnataka State Contractors’ Association with the Chief Minister to help small contractors in general civil works, the court said that the mandate of the circular is not application to the tenders of the Amritha scheme, which is governed under a GO issued under the State’s executive power. While refusing to interfere with the different yardsticks for issuing tenders for civil works under the Amritha scheme and the general civil works, the court said: “The conduct of the State in the entire proceedings cannot be appreciated and requires censure.” COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit",
            "pubDate": "2023-12-06 14:57:35",
            "image_url": null,
            "source_id": "thehindu",
            "source_priority": 2972,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "438b15a2dc8b1c4b3a1d2476213d6076",
            "title": "Prashanti Express Partially Cancelled & SSPN Express Diverted For 2 Months",
            "link": "https://odishabytes.com/prashanti-express-partially-cancelled-sspn-express-diverted-for-2-months/",
            "keywords": [
                "Odisha"
            ],
            "creator": [
                "OB Bureau"
            ],
            "video_url": null,
            "description": "Bhubaneswar: In view of safety related modernisation work, Prashanti Express will run on diverted route and Howrah-Satya Sai Prashanti Nilayam (SSPN) Express have been cancelled partially for two months. The Indian Railways, in a release on Wednesday, said the modernisation work has been taken up in connection with rehabilitation of unlined portion of tunnels and bridges […] The post Prashanti Express Partially Cancelled & SSPN Express Diverted For 2 Months appeared first on odishabytes.",
            "content": "Bhubaneswar: In view of safety related modernisation work, Prashanti Express will run on diverted route and Howrah-Satya Sai Prashanti Nilayam (SSPN) Express have been cancelled partially for two months. The Indian Railways, in a release on Wednesday, said the modernisation work has been taken up in connection with rehabilitation of unlined portion of tunnels and bridges between Satya Sai Prashanti Nilayam and Basampalle railway stations under South-Western Railway jurisdiction. As a result, 22831/22832 Howrah-SSPN-Howrah Express from Howrah on every Wednesday from December 6 to 7 and from SSPN on every Friday from December 8 to 9 will be cancelled partially between Dharmavaram and SSPN on both directions. Similarly, 18464/18463 Bengaluru-Bhubaneswar-Bengaluru Prashanti Express from Bengaluru from December 8 to February 8, 2024 and from Bhubaneswar from December 7 to February 7, 2024 will run on diverted route of Penukonda-Nagasamudram-Dharmavaram on both directions. Get real time updates directly on you device, subscribe now. Prev Post",
            "pubDate": "2023-12-06 14:57:00",
            "image_url": "https://odishabytes.com/wp-content/uploads/2020/07/Train-e1610787851149.jpeg",
            "source_id": "odishabytes",
            "source_priority": 512881,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "60b5f63168d4eda3dc26486b83a9ffbd",
            "title": "Opposition MLAs in Ernakulam to boycott Navakerala Sadas",
            "link": "https://www.thehindu.com/news/cities/Kochi/opposition-mlas-in-ernakulam-to-boycott-navakerala-sadas/article67610903.ece",
            "keywords": [
                "Kochi"
            ],
            "creator": null,
            "video_url": null,
            "description": null,
            "content": "Congress legislators in Ernakulam will boycott the State Cabinet’s public outreach programme Navakerala Sadas as they accused the government of having turned the event into an ‘image building exercise’ for it ahead of the Parliament elections next year. Terming the programme as a diluted version of the ‘Janasamparka’ programme undertaken by the late Chief Minister Oommen Chandy, the MLAs said here on Wednesday that the Cabinet had not been able to resolve complaints submitted at the programme venues. They challenged the government to furnish data about the number of complaints resolved within a week after receiving them. The Opposition MLAs, including K. Babu, T.J. Vinod, Anwar Sadath, Roji M. John, Uma Thomas, and Eldhose Kunnappillil, said the late Chandy had not travelled in a luxury bus to reach out to people. The government, which had failed to ensure the development of the State during the past seven years, wanted to cover it up through the programme, they alleged. The MLAs blamed the government for not providing major projects to Ernakulam district in the past seven years. The district had been denied various development projects despite its higher revenue generation. The Chief Minister had failed to provide reply to various issues raised by Opposition MLAs in the Assembly, they said. COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit state politics",
            "pubDate": "2023-12-06 14:56:26",
            "image_url": null,
            "source_id": "thehindu",
            "source_priority": 2972,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "475b6411180204b0659950a0baa52ca8",
            "title": "UNESCO Recognises Iftar As Part Of Its Intangible Cultural Heritage",
            "link": "https://odishabytes.com/unesco-recognises-iftar-as-part-of-its-intangible-cultural-heritage/",
            "keywords": [
                "Featured",
                "World"
            ],
            "creator": [
                "OB Bureau"
            ],
            "video_url": null,
            "description": "New Delhi: The United Nations (UN) on Wednesday recognised the tradition of Iftar, the meal that breaks daytime fast during the Muslim holy month of Ramadan, by including it on its list of intangible cultural heritage. Iran, Turkey, Azerbaijan and Uzbekistan had jointly submitted the application for socio-the cultural tradition to the UN Educational, Scientific […] The post UNESCO Recognises Iftar As Part Of Its Intangible Cultural Heritage appeared first on odishabytes.",
            "content": "New Delhi: The United Nations (UN) on Wednesday recognised the tradition of Iftar, the meal that breaks daytime fast during the Muslim holy month of Ramadan, by including it on its list of intangible cultural heritage. Iran, Turkey, Azerbaijan and Uzbekistan had jointly submitted the application for socio-the cultural tradition to the UN Educational, Scientific and Cultural Organisation, reported AFP. “Iftar (also called Eftari or Iftor) is observed by Muslims at sunset in the month of Ramadan, upon completion of all religious and ceremonial rites,” said UNESCO. Iftar follows the sunset call to prayer during Ramadan month, and is associated with gatherings “strengthening family and community ties and promoting charity, solidarity and social exchange,” UNESCO said. “The iftar practice is typically transmitted within families, and children and youth are often entrusted with preparing components of traditional meals,” the UN body said. The Intergovernmental Committee for Safeguarding of Intangible Cultural Heritage, which has been meeting in Botswana since Monday, recognised the age-old tradition. Get real time updates directly on you device, subscribe now. Prev Post",
            "pubDate": "2023-12-06 14:56:17",
            "image_url": "https://odishabytes.com/wp-content/uploads/2023/12/Iftar-Unesco-heritage.jpg",
            "source_id": "odishabytes",
            "source_priority": 512881,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "cbc79922b892aa3d24131b7d8ece6ac2",
            "title": "Why Shohei Ohtani is doing himself -- and his sport -- a disservice",
            "link": "https://www.espn.com/mlb/story/_/id/39049998/shohei-ohtani-secret-free-agency-mlb-dodgers-blue-jays",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Ohtani's free agency could have ben fun -- a celebration of baseball. Instead, there is silence and threats. This is a loss for Ohtani -- and for baseball.",
            "content": "Somebody should ask a really simple question about his free agency: What is the point of all of this secrecy? Of course, that would imply that anyone had heard from Ohtani in the past four months. Maybe his silence is Ohtani's choice, or maybe somebody is giving him some really awful advice. But the way this historic free agency has played out is unnecessarily joyless -- and completely antithetical to the way Ohtani competes, the way he loves his craft. His short journey through free agency could have been a celebration of baseball. Ohtani has more leverage than any player ever. Everybody wants him, and everybody wants to give him a lot of money. This really should all be fun, generating excitement among baseball fans dreaming of Ohtani in the lineup of their favorite team. Instead, his decision is being handled like delicate negotiations over a secret spy swap. There is silence and threats, with club executives rolling their eyes as they describe the warnings they have been given from Ohtani's camp about publicly discussing their efforts to sign the most dynamic and popular talent on earth. \"Sorry, can't talk about the guy everybody is talking about,\" said one general manager, laughing. At the winter meetings Tuesday, manager Dave Roberts at Dodger Stadium. (NEWS FLASH: The Biggest Spending Team talks with the Most Prominent Free Agent!) Immediately, there were follow-up questions about why he would release the information in the face of the information blackout enforced by Ohtani's camp, which has said that it will hold leaks against teams with which they are negotiating. General manager Brandon Gomes admitted a few hours later that he was surprised Roberts had confirmed the meetings, refusing to comment on them himself. None of this is necessary. At the All-Star Game, Ohtani circulates among temporary teammates, laughing and posing for pictures, signing autographs for them. There is so much respect for him and for his unique talent, and his free agency could have had the same feel. Instead, this is our reality: A couple of weeks ago, Ohtani sat with a cute dog as he was awarded the Most Valuable Player. It raised a simple question: What's the name of the dog? Where will MLB's No. 1 free agent land this winter? As discussed on the , calls were made to ascertain that small detail. The response, through channels, was this: Ohtani's camp was not prepared to release the dog's name. Again, maybe this was Ohtani's decision. Maybe he was getting bad advice. But it was really pretty silly. He is arguably the greatest international baseball star since Babe Ruth, transcending the sport's typical orbit, and the potential impact of that during his free agency has been squandered. Just imagine how much better served we all would have been if this window was handled progressively, rather than with paranoia. Just as he has done on the field, Ohtani could have set a new standard -- this time for free agent campaigns. Imagine if Ohtani had concluded his visit with the -- the one that neither manager John Schneider nor GM Ross Atkins would confirm Tuesday, given multiple opportunities -- with a Zoom call with reporters. He could open with an homage to the city of Toronto, before describing the impressive tour of the team's new spring training complex. He could've talked about .'s power, 's aggressiveness at the plate, 's splitter. He could've mentioned Schneider's humor, thanked Mark Shapiro and Atkins for their time. He could've capped his reflections with an observation about the Maple Leafs, about Joe Carter's home run. And he could have wrapped it up by announcing a donation to Jays Care -- say, $50,000, pocket change for a player who already makes tens of millions of dollars in endorsements, before he gets the richest contract in the history of North American professional sports -- to help children. He could've deftly answered a few questions from local reporters, easily deflecting the question of where he intends to play by saying he was still going through the process. Whether it's a free agent deal that changes the course of a team's future or a blockbuster trade that has the whole league buzzing, our experts are ready to weigh in. He could've done the same thing with the , the Dodgers and every other team he considered. No matter which team he picked in the end, his time with each franchise would've lifted up the organization, its players, and raised awareness for their charity. He could've lifted baseball. Ohtani is entitled to his privacy, of course, and as we've seen with other sports, employment choices made in the full glare of fan attention can go wrong. LeBron James has excelled in his handling of his career, but you wonder if he would broadcast The Decision again, if he had a chance to do it all over again. And Ohtani's reflex always has seemed to be to bear as little media and fan responsibility as possible, as was clear in his years in Anaheim. But the biggest stars in sports -- Michael Jordan, Derek Jeter, Patrick Mahomes et al -- understood that by speaking with the media, they are speaking to the patrons of their sport: the fans -- the paying customers. Ohtani has not yet embraced that opportunity. And as he nears his decision in the midst of an imposed information blackout, he has missed a chance to serve the game he loves.",
            "pubDate": "2023-12-06 14:54:01",
            "image_url": null,
            "source_id": "espn",
            "source_priority": 18,
            "country": [
                "united states of america",
                "india",
                "singapore",
                "australia",
                "canada",
                "united kingdom"
            ],
            "category": [
                "sports"
            ],
            "language": "english"
        },
        {
            "article_id": "2d2e1f0cd7f66151e93405400c47d0e3",
            "title": "MLB winter meetings updates, rumors and predictions",
            "link": "https://www.espn.com/mlb/story/_/id/39005991/2023-mlb-winter-meetings-updates-rumors-predictions-shohei-ohtani-juan-soto",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "From predicting who will sign where -- and when -- to the latest buzz from Nashville.",
            "content": "The MLB winter meetings are underway in Nashville, Tennessee, and it figures be an action-packed week of rumors, signings and trades. We've got it all covered for you right here, from our experts' predictions heading into the meetings to the latest updates and analysis as the moves go down. Will choose his next team at the meetings? Will we see involving or ? And will big spenders such as the , , and open their wallets in Nashville? Check out our predictions now and refresh often for the latest as the week unfolds. | | | While everyone in this baseball universe, and possibly some baseball universes in other dimensions, awaits Shohei Ohtani's decision about from whom he will accept several hundred millions of dollars, GM Perry Minasian is among the most invested in that resolution. He's not letting it ruin his offseason. \"Every year you're in this position, you feel more comfortable because you've experienced a lot of different things,\" said Minasian, who is participating in his third winter meetings as the Halos' lead exec. \"Over the last three seasons, you create more relationships with other GMs, presidents, agents. There's just a comfort level that increases year by year. That being said, there's a lot of work.\" This time around, the work for Miniasian is complicated by the will-he-or-won't-he factor with Ohtani, as everything around the Angels looks different if Ohtani is, or is not, a part of their future. Still, the front office has to keep churning away amid the uncertainty that goes with the biggest variable remaining a big, fat question mark. When asked about that challenge, Minasian showed that he has learned something about that answer as well: Keep the rhetoric consistent. \"I think you have to have a Plan A, Plan B and Plan C,\" Minasian said, far from the first time. \"That's what you put the work in for. It's something where you need to know the landscape from the free agency standpoint, from a trade standpoint, understand what you can push over the finish line to improve your club. And that's something we'll concentrate on the next two days.\" As for Ohtani, the wait goes on, for Minasian, the Angels and for everybody else with even a passing interest in baseball. The signed reliever to a one-year, $4.5 million deal following what was a bounce-back season for Yates. The right-hander, 37, had a 3.28 ERA in 61 appearances for the last season, striking out 80 batters in 60⅓ innings -- albeit with 37 walks allowed. Last year, Yates held left-handed hitters to a .124 batting average -- just 12 hits in 97 at-bats (five of those hits were homers, however). Chris Young, head of baseball operations for the Rangers, has made it clear that the team's priority this winter is in pitching depth, and the addition of Yates gives them another layer. \"A great competitor with experience in high-leverage situations,\" said one source on Yates. Dodgers manager Dave Roberts with Shohei Ohtani in Los Angeles a couple days ago for two to three hours. \"Clearly,\" he said, \"Shohei's our top priority.\" Meanwhile, Cubs manager Craig Counsell with Shohei Ohtani during the free agent process. Counsell was then asked whether not meeting with him was any indication of the team's interest: \"I don't think this is my spot to talk about individual players. It's a great question but not the spot to talk about it.\" manager Aaron Boone cracked a smile when asked if Yoshinobu Yamamoto, the highly touted Japanese starting pitcher, would look good in pinstripes. \"I think he probably would, yeah,\" Boone said, adding that he was briefly introduced to Yamamoto this offseason and plans to meet with him again. The Yankees are expected to be among the most aggressive suitors for Yamamoto, along with the , and a multitude of others. He's a free agent at just 25 years old and has won the Sawamura Award -- Nippon Professional Baseball's equivalent of the Cy Young Award -- three consecutive years, putting him in position to land a contract that exceeds $200 million. Yamamoto is expected to sign closer to the middle or the end of December. The Yankees had a relatively heavy scouting presence in Japan to watch his starts throughout this past season. \"It's hard to find a 25-year-old pitcher that's as decorated as he is and has had the level of success that he's had at this point in his career over there, and on the world stage in the [World Baseball Classic],\" Boone said. \"Our reports are that this guy's really good, as I think the industry sees it that way. It feels like there's going to be a lot of suitors for him. I feel quite confident that he's going to come over here and be a very special, top-of-the-rotation-type pitcher.\" One of the most coveted pitchers in the hot stove market is White Sox righty . Chicago assistant GM Josh Barfield acknowledged as much when speaking at the winter meetings Tuesday, but teams after Cease are going to have to clear a considerable value bar. \"We're in a position of leverage, because I don't think we have to trade Cease,\" Barfield said. \"It's nice, you know. We have two years of control and he's a really, really good pitcher who definitely helps us next year. At the same time, we've got to be smart and we've got to listen to everything. If we make a move, if we don't, we're just going to be patient and wait for the right one.\" Cease, runner up in the 2022 AL Cy Young balloting, has made 32 or more starts In each of the past three seasons. He's gone 34-24 with a 3.54 ERA during that time while striking out 11.4 batters per nine innings. He has two years of arbitration eligibility remaining before reaching free agency. As the Red Sox move into the Craig Breslow era with a focus on pitching, they have interest in veteran catcher , renowned for his handling of pitchers. Maldonado, 37, played with the Astros the past five seasons, and in his time with Houston, his pitchers and managers strongly advocated for him to be behind the plate -- while the Houston front office looked for alternatives because of Maldonado's subpar offensive production. Last year, Maldonado hit .191 with 15 homers, a .258 on-base percentage and 66 adjusted OPS+. Maldonado has a longstanding friendship with Boston manager Alex Cora, who, like Maldonado, grew up in Puerto Rico. Last year, was the primary catcher for the Red Sox, playing in 126 games and generating an 80 adjusted OPS+. (also with an 80 adjusted OPS+) was the backup. The ' priority at this moment is adding more pitching, as they head into the 2024 season with the hope -- maybe even expectation -- of taking a big step forward. The Tigers have a nice collection of young position players, including the 23-year-old and 22-year-old , with the likes of outfielder Max Clark and infielder Colt Keith on the way. But there is a need for pitching depth, especially after the midseason trade of and the departure of as a free agent. The Tigers signed to a two-year deal this offseason and are hunting for more arms. Detroit finished second in the AL Central last season at 78-84, a significant improvement on 2022 (66-96). A.J. Preller, as you might expect, has talked a lot about in recent days. \"We're definitely getting a lot of calls,\" the ' GM said Monday. The Padres have been shopping Soto, a year away from free agency, throughout the offseason, and the expectation is that he'll be traded relatively soon. But his status could be complicated by the free agencies of and Yoshinobu Yamamoto. A lot of the teams in on Soto are also in on at least one of those two. \"I think there are some teams that when we've had conversations, you can tell they're waiting on a certain free agent or two,\" Preller said, alluding to Ohtani and Yamamoto, neither of whom are expected to sign this week. The expectation throughout the industry has long been that the Padres -- with several holes to plug, especially in their rotation, and a need to drop their payroll from the $250 million-plus it stood at this past season -- will trade Soto. But Preller hasn't come out and said that (no GM would in that situation). In an ideal world, where money is no object, Preller would keep Soto. So far, at least, he seems adamant about not settling for a meager return. \"It's really just about value,\" Preller said. \"I think that there's a lot of different ways that you can do it. We talk about our need for some starting pitching, but we're not gonna take lesser deals just to fill a need. In any of the scenarios.\" Few people on the outside give them much of a chance, but some members of the Angels have privately felt confident about their chances to retain throughout the offseason, even though his price tag might reach $600 million. The and the are heavily in the mix, and other teams -- the , and potentially others -- are also involved. But the comfort and familiarity of the Angels could still be a real draw. Their new manager, Ron Washington, was notably coy when asked about Ohtani on Monday. \"I don't have much to say about that yet because I don't want to let anything out of the bag,\" Washington said. He was asked the natural follow-up: Is there anything to let out of the bag? \"I don't have anything to say about that right now because I don't want to let anything out of the bag,\" he repeated. Only Ohtani seems to know where he's going to sign -- but one player agent believes he'll decide to go back to the Angels. Because of money, sure, but also because he is devoted to routine and no organization would offer him more autonomy than the Angels. \"He can do whatever he wants there,\" said the agent. \"Anywhere else, the expectations (for Ohtani) would be different\" -- in meeting friends of family of the owners, sponsors, the media. On the first day of the winter meetings, the parted with , their once-prized outfield prospect, in what amounted to a cost-saving move, using his ceiling largely to get the contracts of and off their books. The Mariners also traded third baseman and clubhouse favorite earlier this offseason and will seemingly let outfielder walk as a free agent. They're clearly cutting costs. And though some of that savings is expected to be re-invested in the lineup, the industry perception isn't that they're clearing the way for some massive addition. They don't appear to be in on or or any other marquee player at the moment. Mariners manager Scott Servais was asked about skepticism from fans about the team's offseason approach thus far. \"There is,\" he said. \"There is a lot of skepticism. I think, looking at our club, expectations have risen dramatically the last couple years on our team. I said it last year, that's a good thing. We do have a young team. That is exciting. We do want to take the next step to win and, again, we're trying to do the best with the cards that we've been dealt. I think that's the best way to say it.\" The bulk of the Dodgers' traveling party is staying at a hotel other than the sprawling Opryland Resort and Convention Center in Nashville, sparking some conspiracy theories among some agents (about , mostly). But the Dodgers have had this arrangement in place for weeks, to better accommodate their large group. Context is important: The Cardinals' efforts to deal now are an extension of their attempt to deal him before last summer's trade deadline. \"They're going to move him,\" said a rival staffer. manager that the team will make All-Star \"the every-day second baseman\" next season. Speaking on MLB Network, Roberts put to the rest the notion of Betts part-timing in both the infield and outfield as the Dodgers look to win the National League West for the third year in a row. \"It's one of those things where [Betts] is a Gold Glover out in right field, but I think that when you're talking about putting together a roster and someone who can be so offensive at second base, you can get more games out of him if he is playing second base,\" Roberts said. \"So now when you get a happy Mookie Betts, a guy who can play in close to 160 games, it makes the Dodgers much better.\" Betts, 31, was the Dodgers' second baseman against righties last year. But second base is Betts' preferred position, and he thought it'd be easier to stick to one position. The Dodgers also believe that playing second base is easier on his body. The , , , and are all perceived to be in on Shohei Ohtani. All of them are also interested in Yoshinobu Yamamoto, as are the New York Yankees and , among others. And some of those teams -- reportedly the Blue Jays, Yankees, Cubs and Giants -- are also looking to trade for Juan Soto. Two of those three is unlikely for most, if not all. And so, as the winter meetings kick off in Nashville this week, the question on most people's minds is which major domino will fall first. Nez Balelo, the CAA agent who represents Ohtani; Joel Wolfe, the Wasserman agent who represents Yamamoto; and A.J. Preller, the general manager asking teams about Soto, are incentivized to wait for the other. But one of them, of course, has to make the first move. The expectation heading into the week was that a Soto deal would materialize from the winter meetings and that Ohtani and Yamamoto wouldn't sign until after they concluded -- but things can change quickly. Soto will cost more than $30 million through the arbitration process in 2024, while Yamamoto is expected to sign for at least $200 million and Ohtani could command $600 million. Each team in the mix for those players needs certainty for the rest of its offseason. That could trigger heightened aggression. In a market thin on power hitters, is among the most marketable players, coming off a season in which he clubbed 36 homers and generated a .512 slugging percentage. But like other free agents, he will likely have to wait for Shohei Ohtani to make his decision -- because, according to sources, at least one of the teams talking with Ohtani is positioned to pivot to a run on Soler if Ohtani signs elsewhere. Left-handed-hitting outfielder Jung Hoo Lee and right-handed reliever Woo Suk Go of the Korean Baseball Organization were , spanning from 8 a.m. ET on Tuesday to 5 p.m. ET on Jan. 3. is set to potentially make more than the $10 million option he declined with Milwaukee last month. He is returning to the Brewers on a new deal that will include incentives and a buyout could push him past that mark, sources tell ESPN. He could end up being the team's Opening Day starter if is traded. Because the face a payroll crunch, they are expected to trade Juan Soto, who is in line to make something in the neighborhood of $33 million for the 2024 season. But Padres GM A.J. Preller doesn't have to trade him this week -- and some rival executives said Saturday that there might be a long wait before a Soto deal is concluded. Rival executives say that the Padres' current asking price for Soto is very high, with San Diego looking for major league ready pitching, plus others. With a generational talent like Soto, Preller could just wait to see if some team in the market -- maybe a team that loses out in the bidding -- steps up. \"I think this has all the makings of a late January or early February deal,\" said one front office type whose team is not involved. If so, this would not be the first time a superstar moved very late in the winter. , Johan Santana, Roger Clemens and are among the elite talents who didn't change teams until well after Christmas. Rival executives say that while there are many teams who would love to take Soto in a pure salary dump, there are likely very few teams willing to embrace the current circumstances: Surrendering young big leaguers or high-end prospects for an expensive rental who is expected to test free agency next fall. The dangled Mookie Betts under similar conditions prior to the 2019 season, and there were only two serious suitors; which is why, in the end, the were rewarded for their patience and got him for and a couple of others, while taking on and the $48 million owed to the left-hander. When Lindor was traded, the Guardians didn't have a lot of potential bidders. When Santana was dealt, Minnesota was forced to make a trade with the Mets, the one team willing to give him a contract extension. The have serious interest in Soto, with some young pitching to offer, and some rival executives believe that the Giants are a team to watch because they, too, have depth in starting pitching. The Padres, currently intent on contending in 2024, have to fill three-fifths of their rotation. The Blue Jays, staring at a two-year window before and . reach free agency, have the need for a hitter -- which is why they've been in on Ohtani -- but lack pitching depth. If the Dodgers miss on Ohtani, they might have the pitching depth to make a deal for Soto, but there would be a question about whether San Diego would deal a future Hall of Famer to their most significant NL West rival. emerged as a star in his time with the , drawing votes for the Cy Young Award in three different seasons -- and that goes a long way to explaining the initial interest expressed by the White Sox in possibly bringing him back as a free agent this winter. Ethan Katz, Giolito's high school pitching coach, continues to work with the White Sox, and Chicago has upgraded its pitching department with the addition of respected analyst Brian Bannister, who formerly worked with the Red Sox and Giants. But a reunion of Giolito and the White Sox is probably unlikely, given this winter's circumstances. Although Giolito struggled after being traded to the Angels and then was picked up on waivers by the Guardians, he should get strong offers in this market -- some executives compared him to the likes of (who got $68 million over four years from the Cubs), and as the White Sox begin to rebuild, the price of a big contract and the timing might not be a fit. Depending on how the market plays out, there might be a better fit with another of Katz's former pupils -- former Cardinals pitcher , the right-hander who might need to take a short-term deal to reestablish his value and then hit the market again next fall. For the White Sox, the investment could be worthwhile because if Flaherty rebounds to what he was early in his career in St. Louis, he could be an interesting trade chip during the 2024 season or a candidate for an extension. Ohtani signing during the winter meetings would definitely be MLB's preference, and at this point, that would be my guess too. Many have long speculated that Ohtani's free agency would play out relatively quickly, and I don't expect him to wait until Yoshinobu Yamamoto comes off the board to pick his new team. By next week, he might have a pretty good grasp of what he wants, as (at times) the winter meetings have a tendency of spurring action. At this point, I'd pick the to sign him, but it's tough to rule out the Dodgers or the . Some executives tracking the Ohtani negotiations believe he could pick his team sometime over the weekend, or very early in the winter meetings. During the season, a friend of Ohtani said he believed the two-way star knew long ago where he wanted to land, but because this negotiation is expected to generate the biggest contract in baseball history, his representation needs a little dog-and-pony show to goose the bidding just a little more. Executives will tell you frankly they know almost nothing about what he really wants, outside of this: Based on his initial choice of the Angels, he seems to want to play in warmer weather, which is why I still believe he'll land with the Dodgers. By Thursday, Ohtani will have chosen the Dodgers. They check too many boxes -- unless there's simply an underlying reason that no one knows about that would prevent him from signing there. If the agent (and team) has any say in any of this, it should be in the timing of an announcement. And what better place to make it than where the baseball world has gathered? There are plenty of breadcrumbs telling us Ohtani doesn't exactly love the spotlight, but for this signing, he'll have to bask in it. This is just a guess, but Ohtani will sign with the Dodgers on Tuesday following a spate of rumors that have him signing with various teams, though at first it's unclear whether it's in the States or back in Japan. Then it turns out that he never spoke to any of those teams and he has been dreaming of Dodger Blue all along. A dream and $600 million is all it took. How much will the biggest stars get paid this winter? Kiley McDaniel breaks down this year's free agent class. Well, no doubt a lot of agents, players and front offices would love for Ohtani to sign in Nashville. Once he's off the board, the teams that went after him and failed will then turn their attention to their next options, which could lead to some escalating offers for the likes of , and . So for the sake of moving this winter along, let's hope it happens and there's a big news conference -- even if we know Ohtani isn't one for the spotlight. And who will host that news conference? I'll stick with the Dodgers. . The expectation from rival executives heading into the offseason was that the would eventually trade him, and some have gotten the sense lately that it could happen relatively soon. If it doesn't happen over the weekend, it could next week. At the very least, Soto trade talk will continue to dominate the conversation. Soto. He's a future Hall of Famer and expensive, and despite what the Padres and agent Scott Boras have presented publicly, there is an industry-wide expectation that financial pressures will compel San Diego to deal him. Interestingly, rival executives report that the Padres are looking for inexpensive major league or major league-ready players in return, to bolster San Diego's effort to contend in 2024. With the passing of owner Peter Seidler, who was a great advocate for A.J. Preller, the Padres' GM may be in a prove-it type season next year with his new bosses and the need to win. Knowing that Preller works a bit mysteriously, I'll take the field over Soto. OK, that's a bit broad. I'll go with and/or . Both are as good as gone. Once the add that one more prospect to upgrade their existing offer, Cease -- a Georgia native -- will go home to pitch. From the big names to know to when Shohei Ohtani could actually sign, here are the players, teams and themes that will dominate the hot stove headlines. Most everybody else seems to be going with Soto, and that makes a lot of sense to me. But just to be contrarian, I'll say and that he'll sign with the . Then we can start planning for that Hader/Travis Jankowski mullet contest, assuming the Rangers don't let the outfielder get away. It'll be the biggest draw of the year at Globe Life Field. I'll go with Soto as well. The Padres have so many moving parts this offseason -- they have to replace Snell, Hader, (who signed with the this week) and , four pitchers who combined for 67 starts, 30 wins and 34 saves -- that making a decision on Soto is necessary just to help them figure out the rest of their moves. It's all going to be about high-impact starting pitching, from Yamamoto to reigning AL Cy Young winner Snell to some of the big arms being dangled on the trade front (Cease, Glasnow, ). Some of the richest teams still need starting pitching, and there is still plenty to choose from. It might sound weird, but the Yamamoto negotiations have been underplayed to date. He is in as good a negotiating position as any free agent pitcher since , with the richest of the big-market teams all pursuing him aggressively. The Yankees, Dodgers and , plus other clubs, are among them, and there seems to be a willingness among these teams to assume extra risk because of his talent and age. One team official involved in the Yamamoto discussions believes the pitcher's negotiations won't be resolved until after the winter meetings, but let's face it -- the direction of some of the biggest spenders won't be fully determined until he picks a team, which is why the specter of Yamamoto will hover over Nashville even if he doesn't sign. Ohtani, Ohtani, Ohtani. Until he signs, he's the topic. Fan bases are waiting, marketing and sales departments are waiting, baseball ops departments are waiting. How can he not be the topic, both where will he go and for how much? Unless he signs on Day 1 of the winter meetings, it's going to build all week. After that, the amount of trade rumors will be larger than normal, considering how many good players are likely to move. Free agency (outside of Ohtani) will have its moment, but not necessarily at the meetings. Trade talk will percolate while we wait on Shohei. Whether it's a free agent deal that changes the course of a team's future or a blockbuster trade that has the whole league buzzing, our experts are ready to weigh in. I can imagine all manner of Soto rumors. The thing is, as good as he is, it's hard to truly construct a fair value trade that works for the Padres, assuming their aim is to convert him into multiple players who can deepen their MLB roster. We're still talking about getting him for one season, and the teams that might want him to put themselves over the top will prefer to deal prospects instead of major leaguers. If the Padres don't want prospects, then where do they turn? This scenario changes if San Diego is mainly motivated by a desire to clear payroll. This doesn't seem like Preller's way, especially since he kind of needs to win, and soon. Everyone wants to drop Soto onto the Yankees, but it seems way more complicated than that to me. Yes, moving Soto for prospects clears space for free agent adds, but that can get dicey if you're talking about matching value for value for a team that wants to contend, especially given a light free agent class. I do think Soto will be traded, but it's a really complicated proposition. All the front-line starting pitching available in trades. Then there are the potential ripple effects. If Burnes is traded, do the then make closer available? If the White Sox trade Cease, does that lead to a complete teardown ... maybe even including Luis Robert, who, given his years of team control (four) and reasonable salary, has more trade value than Soto?",
            "pubDate": "2023-12-06 14:54:01",
            "image_url": null,
            "source_id": "espn",
            "source_priority": 18,
            "country": [
                "united states of america",
                "india",
                "singapore",
                "australia",
                "canada",
                "united kingdom"
            ],
            "category": [
                "sports"
            ],
            "language": "english"
        },
        {
            "article_id": "696c1dd75851070c69da91c5c526d815",
            "title": "Those who call themselves as secular have their own caste background: Ravi",
            "link": "https://www.thehindu.com/news/cities/Mangalore/those-who-call-themselves-as-secular-have-their-own-caste-background-ravi/article67611306.ece",
            "keywords": [
                "Mangaluru"
            ],
            "creator": null,
            "video_url": null,
            "description": "The concept of secularism itself is a subject for debate as secular leaders will lose leadership without caste background, says the BJP leader",
            "content": "Former national general secretary of the Bharatiya Janata Party C.T. Ravi on Wednesday said the concept of secularism itself was a subject for debate even as those who call themselves as secular have their own caste background. Speaking at the Dr. B.R. Ambedkar Mahaparinirvas Diwas programme organised by the Dakshina Kannada district BJP here, Mr. Ravi said a majority of the so-called secular leaders would lose their leadership without the caste background. While secular leaders do politics based on caste, it is unfortunate that the BJP that advocates “Sarvadharma Samabhava” was labelled as communal, he regretted. Stating that the politics of appeasement was dangerous to the nation, Mr. Ravi noted, “Abrogation of Article 370 by the BJP government led by Prime Minister Narendra Modi has led to drastic changes in Jammu and Kashmir where the Indian tricolour is seen in front of government offices and children sing ‘Vande mataram’.” National security could be at stake if the government introduces caste-based reservation for recruitment to armed forces as suggested by the Rajendra Sachar committee, he said. Mr. Modi who advocates the first right of the poor over national resources was dubbed communal while former Prime Minister Manmohan Singh, who said Muslims had the first right over resources, was called secular, he said. Mr. Ravi said the BJP never introduced any scheme based on caste while referring to Chief Minister Siddaramaiah’s reported announcement to increase plan outlay for minorities from ₹4,000 crore to ₹10,000 crore. Demands CBI probe Meanwhile, Mr. Ravi demanded a high-level probe, preferably either by the Central Bureau of Investigation or by the National Investigation Agency, into the allegations of IS presence in the South India conference of Muslim religious heads held at Hubballi where Mr. Siddaramaiah was present on Tuesday. He was responding to a query about charges by BJP MLA Basanagouda Patil Yatnal in this regard. Mr. Yatnal posted on X on Wednesday, “Chief Minister Siddaramaiah shared the dais with ISIS supporters and Terror Sympathizers yesterday at Hubli. Tanveer Peera is a Terror Sympathiser who has links with Terror Outfits across the Middle East. Attached Images are his recent visits to the Middle East meeting the Terror Sympathizer and Radical Islamic Operatives.” COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit Mangalore",
            "pubDate": "2023-12-06 14:52:58",
            "image_url": "https://th-i.thgim.com/public/incoming/z2eam0/article67611664.ece/alternates/LANDSCAPE_1200/07_mn%20C%20T%20Ravi.jpg",
            "source_id": "thehindu",
            "source_priority": 2972,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "article_id": "04a7baf576a638c66af19994ff4e6125",
            "title": "Cabinet approval must for pardoning of convicts in Kerala",
            "link": "https://www.thehindu.com/news/cities/Kochi/cabinet-approval-must-for-pardoning-of-convicts-in-kerala/article67611531.ece",
            "keywords": [
                "Kochi"
            ],
            "creator": null,
            "video_url": null,
            "description": null,
            "content": "KOCHI The approval of the Council of Ministers would become mandatory for pardoning convicts and suspending, remitting or commuting the sentence awarded to them in Kerala. The State Cabinet, which met on Wednesday, has decided to seek the consent of the Governor to bring amendments to the Second Schedule of the Rules of Business of Kerala Government making the clearance of the Council of Ministers mandatory for pardoning a convict and suspending, remitting or commuting the sentence awarded to convicts. Currently, the Minister holding charge of the Home department can single-handedly forward to the Governor for approval, the recommendation for the pardon, remission and commutation of the sentence given to prisoners on special occasions or on consideration of their age, health conditions and other factors. The Home Minister can forward the recommendations for the approval of the Governor on the basis of a report filed by a high-level committee consisting of the State Home and Law Secretaries and the Director General of Prisons and Correctional Services. The proposed amendments will not take away the Governor’s discretionary powers either to reject the recommendations or to ask the State government to reconsider them. The Governor can reject the list even when the recommendations are repeated by the government. The Governor, who is not bound by the recommendation of the State Cabinet in this case, can act independently, pointed out legal experts. Some of the earlier recommendations of the Chief Ministers and the Home Ministers for the pardon of prisoners and remission and commutation of the sentences had run into controversies. Allegations of political favouritism had marred such recommendations in the State. However, the proposed amendments would make the recommendations a collective decision of the Council of Ministers and deny the Home Minister the unbridled freedom to make such proposals. The proposed amendments are being considered in the light of some recent decisions from the Kerala High Court and the Supreme Court, legal sources said. COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit",
            "pubDate": "2023-12-06 14:52:16",
            "image_url": null,
            "source_id": "thehindu",
            "source_priority": 2972,
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        }
    ],
    "nextPage": "1701874336580903844"
}